kjhjk/app/controllers/home_controller.rb

   def foodcategories

    # @count = Restaurantlist.count()
  #@user=Foodcategory.find_by_rest_id(params[:rest_id])
  @user = Foodcategory.where("rest_id = ?",params[:rest_id] )
---
SELECT `foodcategories`.* FROM `foodcategories`  WHERE `foodcategories`.`id` IN ('all', '---\n:conditions:\n  :rest_id: \'1\'\n')