kjhjk/app/controllers/passwords_controller.rb

 def create

     @user=User.find_by_email(params[:email])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'saurabh@clicklabs.in'  ORDER BY `users`.`id` ASC LIMIT 1

  def update
     # @user = current_user
   @user = User.find_by_useraccesstoken(params[:reset_password_token])
     #render json: {'here'=>@user} and return

      if @user.update_attribute(:password,params[:password])    # Sign in the user by passing validation in case his password changed
---
SELECT  `users`.* FROM `users`  WHERE `users`.`useraccesstoken` = 'd48187ab-04fc-4e19-8901-addbaa54e172' LIMIT 1
UPDATE `users` SET `encrypted_password` = ?, `updated_at` = ?, `useraccesstoken` = ? WHERE `users`.`id` = 4  [["encrypted_password", "$2a$10$ujCUjGuW.24.m1Bkdso7KuCApRBt4dtO3nYBlW3Ih3D7mtyiVN6i2"], ["updated_at", "2014-07-24 10:39:17"], ["useraccesstoken", "ea483dd3-2528-4197-8dbf-7ea238c8fa9d"]]