kjhjk/app/controllers/registrations_controller.rb

INSERT INTO `users` (`created_at`, `devicetoken`, `devicetype`, `email`, `encrypted_password`, `updated_at`, `useraccesstoken`, `username`) VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
def create
  @user = User.new(user_params)
  #render json: {'here'=>@user} and return
   if @user.save