kjhjk/app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'salma.arsh06@gmail.com' LIMIT 1
UPDATE `users` SET `current_sign_in_at` = ?, `sign_in_count` = ?, `updated_at` = ?, `useraccesstoken` = ? WHERE `users`.`id` = 4  [["current_sign_in_at", "2014-07-23 09:23:14"], ["sign_in_count", 2], ["updated_at", "2014-07-23 09:23:14"], ["useraccesstoken", "50f35867-93e3-47f2-8aae-facd1c03ccf0"]]
INSERT INTO `users` (`created_at`, `devicetoken`, `devicetype`, `email`, `fbaccesstoken`, `fbid`, `logintype`, `updated_at`, `useraccesstoken`, `username`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #  @user = User.new
    # if !@user.blank?
   if (params[:logintype].blank? || params[:devicetype].blank?)
     flash[:error] = "fill all entries"
     render "new"
   end
    if params[:logintype] == "1"
      if @user=User.find_by_email(params[:email])
        if @user.valid_password?(params[:password])
         @user.update_attribute(:devicetype,params[:devicetype])
         @user.update_attribute(:devicetoken,params[:devicetoken])
   # render json: {'here'=>@user}
          sign_in @user
          redirect_to root_path
       else
         flash[:error] = "incorrect entries"
         render"new"
        end
      end
   elsif params[:logintype] == "0"

      @user = User.new(all_params)
      if @user.save